MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2682/mcu.h
// Register: B0D5
#define B0D5 B0D5
extern volatile unsigned char           B0D5                __at(0xE2B);
#ifndef _LIB_BUILD
asm("B0D5 equ 0E2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D50                  :1;
        unsigned B0D51                  :1;
        unsigned B0D52                  :1;
        unsigned B0D53                  :1;
        unsigned B0D54                  :1;
        unsigned B0D55                  :1;
        unsigned B0D56                  :1;
        unsigned B0D57                  :1;
    };
} B0D5bits_t;
extern volatile B0D5bits_t B0D5bits __at(0xE2B);
// bitfield macros
#define _B0D5_B0D50_POSN                                    0x0
#define _B0D5_B0D50_POSITION                                0x0
#define _B0D5_B0D50_SIZE                                    0x1
#define _B0D5_B0D50_LENGTH                                  0x1
#define _B0D5_B0D50_MASK                                    0x1
#define _B0D5_B0D51_POSN                                    0x1
#define _B0D5_B0D51_POSITION                                0x1
#define _B0D5_B0D51_SIZE                                    0x1
#define _B0D5_B0D51_LENGTH                                  0x1
#define _B0D5_B0D51_MASK                                    0x2
#define _B0D5_B0D52_POSN                                    0x2
#define _B0D5_B0D52_POSITION                                0x2
#define _B0D5_B0D52_SIZE                                    0x1
#define _B0D5_B0D52_LENGTH                                  0x1
#define _B0D5_B0D52_MASK                                    0x4
#define _B0D5_B0D53_POSN                                    0x3
#define _B0D5_B0D53_POSITION                                0x3
#define _B0D5_B0D53_SIZE                                    0x1
#define _B0D5_B0D53_LENGTH                                  0x1
#define _B0D5_B0D53_MASK                                    0x8
#define _B0D5_B0D54_POSN                                    0x4
#define _B0D5_B0D54_POSITION                                0x4
#define _B0D5_B0D54_SIZE                                    0x1
#define _B0D5_B0D54_LENGTH                                  0x1
#define _B0D5_B0D54_MASK                                    0x10
#define _B0D5_B0D55_POSN                                    0x5
#define _B0D5_B0D55_POSITION                                0x5
#define _B0D5_B0D55_SIZE                                    0x1
#define _B0D5_B0D55_LENGTH                                  0x1
#define _B0D5_B0D55_MASK                                    0x20
#define _B0D5_B0D56_POSN                                    0x6
#define _B0D5_B0D56_POSITION                                0x6
#define _B0D5_B0D56_SIZE                                    0x1
#define _B0D5_B0D56_LENGTH                                  0x1
#define _B0D5_B0D56_MASK                                    0x40
#define _B0D5_B0D57_POSN                                    0x7
#define _B0D5_B0D57_POSITION                                0x7
#define _B0D5_B0D57_SIZE                                    0x1
#define _B0D5_B0D57_LENGTH                                  0x1
#define _B0D5_B0D57_MASK                                    0x80

// Register: B0D6
#define B0D6 B0D6
extern volatile unsigned char           B0D6                __at(0xE2C);
#ifndef _LIB_BUILD
asm("B0D6 equ 0E2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D60                  :1;
        unsigned B0D61                  :1;
        unsigned B0D62                  :1;
        unsigned B0D63                  :1;
        unsigned B0D64                  :1;
        unsigned B0D65                  :1;
        unsigned B0D66                  :1;
        unsigned B0D67                  :1;
    };
} B0D6bits_t;
extern volatile B0D6bits_t B0D6bits __at(0xE2C);
// bitfield macros
#define _B0D6_B0D60_POSN                                    0x0
#define _B0D6_B0D60_POSITION                                0x0
#define _B0D6_B0D60_SIZE                                    0x1
#define _B0D6_B0D60_LENGTH                                  0x1
#define _B0D6_B0D60_MASK                                    0x1
#define _B0D6_B0D61_POSN                                    0x1
#define _B0D6_B0D61_POSITION                                0x1
#define _B0D6_B0D61_SIZE                                    0x1
#define _B0D6_B0D61_LENGTH                                  0x1
#define _B0D6_B0D61_MASK                                    0x2
#define _B0D6_B0D62_POSN                                    0x2
#define _B0D6_B0D62_POSITION                                0x2
#define _B0D6_B0D62_SIZE                                    0x1
#define _B0D6_B0D62_LENGTH                                  0x1
#define _B0D6_B0D62_MASK                                    0x4
#define _B0D6_B0D63_POSN                                    0x3
#define _B0D6_B0D63_POSITION                                0x3
#define _B0D6_B0D63_SIZE                                    0x1
#define _B0D6_B0D63_LENGTH                                  0x1
#define _B0D6_B0D63_MASK                                    0x8
#define _B0D6_B0D64_POSN                                    0x4
#define _B0D6_B0D64_POSITION                                0x4
#define _B0D6_B0D64_SIZE                                    0x1
#define _B0D6_B0D64_LENGTH                                  0x1
#define _B0D6_B0D64_MASK                                    0x10
#define _B0D6_B0D65_POSN                                    0x5
#define _B0D6_B0D65_POSITION                                0x5
#define _B0D6_B0D65_SIZE                                    0x1
#define _B0D6_B0D65_LENGTH                                  0x1
#define _B0D6_B0D65_MASK                                    0x20
#define _B0D6_B0D66_POSN                                    0x6
#define _B0D6_B0D66_POSITION                                0x6
#define _B0D6_B0D66_SIZE                                    0x1
#define _B0D6_B0D66_LENGTH                                  0x1
#define _B0D6_B0D66_MASK                                    0x40
#define _B0D6_B0D67_POSN                                    0x7
#define _B0D6_B0D67_POSITION                                0x7
#define _B0D6_B0D67_SIZE                                    0x1
#define _B0D6_B0D67_LENGTH                                  0x1
#define _B0D6_B0D67_MASK                                    0x80

