MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2682/mcu.h
#define                                 RXF14SID3_bit       _BIT_ACCESS(RXF14SIDH,0)
// RXF14SIDH<RXF14SID4>
extern volatile __bit                   RXF14SID4           __at(0x6C41);	// @ (0xD88 * 8 + 1)
#define                                 RXF14SID4_bit       _BIT_ACCESS(RXF14SIDH,1)
// RXF14SIDH<RXF14SID5>
extern volatile __bit                   RXF14SID5           __at(0x6C42);	// @ (0xD88 * 8 + 2)
#define                                 RXF14SID5_bit       _BIT_ACCESS(RXF14SIDH,2)
// RXF14SIDH<RXF14SID6>
extern volatile __bit                   RXF14SID6           __at(0x6C43);	// @ (0xD88 * 8 + 3)
#define                                 RXF14SID6_bit       _BIT_ACCESS(RXF14SIDH,3)
// RXF14SIDH<RXF14SID7>
extern volatile __bit                   RXF14SID7           __at(0x6C44);	// @ (0xD88 * 8 + 4)
#define                                 RXF14SID7_bit       _BIT_ACCESS(RXF14SIDH,4)
// RXF14SIDH<RXF14SID8>
extern volatile __bit                   RXF14SID8           __at(0x6C45);	// @ (0xD88 * 8 + 5)
#define                                 RXF14SID8_bit       _BIT_ACCESS(RXF14SIDH,5)
// RXF14SIDH<RXF14SID9>
extern volatile __bit                   RXF14SID9           __at(0x6C46);	// @ (0xD88 * 8 + 6)
#define                                 RXF14SID9_bit       _BIT_ACCESS(RXF14SIDH,6)
// RXF15EIDL<RXF15EID0>
extern volatile __bit                   RXF15EID0           __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 RXF15EID0_bit       _BIT_ACCESS(RXF15EIDL,0)
// RXF15EIDL<RXF15EID1>
extern volatile __bit                   RXF15EID1           __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 RXF15EID1_bit       _BIT_ACCESS(RXF15EIDL,1)
// RXF15EIDH<RXF15EID10>
extern volatile __bit                   RXF15EID10          __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 RXF15EID10_bit      _BIT_ACCESS(RXF15EIDH,2)
// RXF15EIDH<RXF15EID11>
extern volatile __bit                   RXF15EID11          __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 RXF15EID11_bit      _BIT_ACCESS(RXF15EIDH,3)
// RXF15EIDH<RXF15EID12>
extern volatile __bit                   RXF15EID12          __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 RXF15EID12_bit      _BIT_ACCESS(RXF15EIDH,4)
// RXF15EIDH<RXF15EID13>
extern volatile __bit                   RXF15EID13          __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 RXF15EID13_bit      _BIT_ACCESS(RXF15EIDH,5)
// RXF15EIDH<RXF15EID14>
extern volatile __bit                   RXF15EID14          __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 RXF15EID14_bit      _BIT_ACCESS(RXF15EIDH,6)
// RXF15EIDH<RXF15EID15>
extern volatile __bit                   RXF15EID15          __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 RXF15EID15_bit      _BIT_ACCESS(RXF15EIDH,7)
// RXF15SIDL<RXF15EID16>
extern volatile __bit                   RXF15EID16          __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 RXF15EID16_bit      _BIT_ACCESS(RXF15SIDL,0)
// RXF15SIDL<RXF15EID17>
extern volatile __bit                   RXF15EID17          __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 RXF15EID17_bit      _BIT_ACCESS(RXF15SIDL,1)
// RXF15EIDL<RXF15EID2>
extern volatile __bit                   RXF15EID2           __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 RXF15EID2_bit       _BIT_ACCESS(RXF15EIDL,2)
// RXF15EIDL<RXF15EID3>
extern volatile __bit                   RXF15EID3           __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 RXF15EID3_bit       _BIT_ACCESS(RXF15EIDL,3)
// RXF15EIDL<RXF15EID4>
extern volatile __bit                   RXF15EID4           __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 RXF15EID4_bit       _BIT_ACCESS(RXF15EIDL,4)
// RXF15EIDL<RXF15EID5>
extern volatile __bit                   RXF15EID5           __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 RXF15EID5_bit       _BIT_ACCESS(RXF15EIDL,5)
// RXF15EIDL<RXF15EID6>
extern volatile __bit                   RXF15EID6           __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 RXF15EID6_bit       _BIT_ACCESS(RXF15EIDL,6)
// RXF15EIDL<RXF15EID7>
extern volatile __bit                   RXF15EID7           __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 RXF15EID7_bit       _BIT_ACCESS(RXF15EIDL,7)
// RXF15EIDH<RXF15EID8>
extern volatile __bit                   RXF15EID8           __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 RXF15EID8_bit       _BIT_ACCESS(RXF15EIDH,0)
// RXF15EIDH<RXF15EID9>
extern volatile __bit                   RXF15EID9           __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 RXF15EID9_bit       _BIT_ACCESS(RXF15EIDH,1)
// RXFCON1<RXF15EN>
extern volatile __bit                   RXF15EN             __at(0x6EAF);	// @ (0xDD5 * 8 + 7)
#define                                 RXF15EN_bit         _BIT_ACCESS(RXFCON1,7)
// RXF15SIDL<RXF15EXIDEN>
extern volatile __bit                   RXF15EXIDEN         __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 RXF15EXIDEN_bit     _BIT_ACCESS(RXF15SIDL,3)
// RXF15SIDL<RXF15SID0>
extern volatile __bit                   RXF15SID0           __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 RXF15SID0_bit       _BIT_ACCESS(RXF15SIDL,5)
// RXF15SIDL<RXF15SID1>
extern volatile __bit                   RXF15SID1           __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 RXF15SID1_bit       _BIT_ACCESS(RXF15SIDL,6)
// RXF15SIDH<RXF15SID10>
extern volatile __bit                   RXF15SID10          __at(0x6C87);	// @ (0xD90 * 8 + 7)
#define                                 RXF15SID10_bit      _BIT_ACCESS(RXF15SIDH,7)
// RXF15SIDL<RXF15SID2>
extern volatile __bit                   RXF15SID2           __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 RXF15SID2_bit       _BIT_ACCESS(RXF15SIDL,7)
// RXF15SIDH<RXF15SID3>
extern volatile __bit                   RXF15SID3           __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 RXF15SID3_bit       _BIT_ACCESS(RXF15SIDH,0)
// RXF15SIDH<RXF15SID4>
extern volatile __bit                   RXF15SID4           __at(0x6C81);	// @ (0xD90 * 8 + 1)
#define                                 RXF15SID4_bit       _BIT_ACCESS(RXF15SIDH,1)
// RXF15SIDH<RXF15SID5>
extern volatile __bit                   RXF15SID5           __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 RXF15SID5_bit       _BIT_ACCESS(RXF15SIDH,2)
// RXF15SIDH<RXF15SID6>
extern volatile __bit                   RXF15SID6           __at(0x6C83);	// @ (0xD90 * 8 + 3)
#define                                 RXF15SID6_bit       _BIT_ACCESS(RXF15SIDH,3)
// RXF15SIDH<RXF15SID7>
extern volatile __bit                   RXF15SID7           __at(0x6C84);	// @ (0xD90 * 8 + 4)
#define                                 RXF15SID7_bit       _BIT_ACCESS(RXF15SIDH,4)
// RXF15SIDH<RXF15SID8>
extern volatile __bit                   RXF15SID8           __at(0x6C85);	// @ (0xD90 * 8 + 5)
#define                                 RXF15SID8_bit       _BIT_ACCESS(RXF15SIDH,5)
// RXF15SIDH<RXF15SID9>
extern volatile __bit                   RXF15SID9           __at(0x6C86);	// @ (0xD90 * 8 + 6)
#define                                 RXF15SID9_bit       _BIT_ACCESS(RXF15SIDH,6)
// RXF1EIDL<RXF1EID0>
extern volatile __bit                   RXF1EID0            __at(0x7838);	// @ (0xF07 * 8 + 0)
#define                                 RXF1EID0_bit        _BIT_ACCESS(RXF1EIDL,0)
// RXF1EIDL<RXF1EID1>
extern volatile __bit                   RXF1EID1            __at(0x7839);	// @ (0xF07 * 8 + 1)
#define                                 RXF1EID1_bit        _BIT_ACCESS(RXF1EIDL,1)
// RXF1EIDH<RXF1EID10>
extern volatile __bit                   RXF1EID10           __at(0x7832);	// @ (0xF06 * 8 + 2)
#define                                 RXF1EID10_bit       _BIT_ACCESS(RXF1EIDH,2)
// RXF1EIDH<RXF1EID11>
extern volatile __bit                   RXF1EID11           __at(0x7833);	// @ (0xF06 * 8 + 3)
#define                                 RXF1EID11_bit       _BIT_ACCESS(RXF1EIDH,3)
// RXF1EIDH<RXF1EID12>
extern volatile __bit                   RXF1EID12           __at(0x7834);	// @ (0xF06 * 8 + 4)
#define                                 RXF1EID12_bit       _BIT_ACCESS(RXF1EIDH,4)
// RXF1EIDH<RXF1EID13>
extern volatile __bit                   RXF1EID13           __at(0x7835);	// @ (0xF06 * 8 + 5)
#define                                 RXF1EID13_bit       _BIT_ACCESS(RXF1EIDH,5)
// RXF1EIDH<RXF1EID14>
extern volatile __bit                   RXF1EID14           __at(0x7836);	// @ (0xF06 * 8 + 6)
#define                                 RXF1EID14_bit       _BIT_ACCESS(RXF1EIDH,6)
// RXF1EIDH<RXF1EID15>
extern volatile __bit                   RXF1EID15           __at(0x7837);	// @ (0xF06 * 8 + 7)
#define                                 RXF1EID15_bit       _BIT_ACCESS(RXF1EIDH,7)
// RXF1SIDL<RXF1EID16>
extern volatile __bit                   RXF1EID16           __at(0x7828);	// @ (0xF05 * 8 + 0)
#define                                 RXF1EID16_bit       _BIT_ACCESS(RXF1SIDL,0)
// RXF1SIDL<RXF1EID17>
extern volatile __bit                   RXF1EID17           __at(0x7829);	// @ (0xF05 * 8 + 1)
#define                                 RXF1EID17_bit       _BIT_ACCESS(RXF1SIDL,1)
// RXF1EIDL<RXF1EID2>
extern volatile __bit                   RXF1EID2            __at(0x783A);	// @ (0xF07 * 8 + 2)
#define                                 RXF1EID2_bit        _BIT_ACCESS(RXF1EIDL,2)
// RXF1EIDL<RXF1EID3>
extern volatile __bit                   RXF1EID3            __at(0x783B);	// @ (0xF07 * 8 + 3)
#define                                 RXF1EID3_bit        _BIT_ACCESS(RXF1EIDL,3)
// RXF1EIDL<RXF1EID4>
extern volatile __bit                   RXF1EID4            __at(0x783C);	// @ (0xF07 * 8 + 4)
#define                                 RXF1EID4_bit        _BIT_ACCESS(RXF1EIDL,4)
// RXF1EIDL<RXF1EID5>
extern volatile __bit                   RXF1EID5            __at(0x783D);	// @ (0xF07 * 8 + 5)
#define                                 RXF1EID5_bit        _BIT_ACCESS(RXF1EIDL,5)
// RXF1EIDL<RXF1EID6>
extern volatile __bit                   RXF1EID6            __at(0x783E);	// @ (0xF07 * 8 + 6)
#define                                 RXF1EID6_bit        _BIT_ACCESS(RXF1EIDL,6)
// RXF1EIDL<RXF1EID7>
extern volatile __bit                   RXF1EID7            __at(0x783F);	// @ (0xF07 * 8 + 7)
#define                                 RXF1EID7_bit        _BIT_ACCESS(RXF1EIDL,7)
// RXF1EIDH<RXF1EID8>
extern volatile __bit                   RXF1EID8            __at(0x7830);	// @ (0xF06 * 8 + 0)
#define                                 RXF1EID8_bit        _BIT_ACCESS(RXF1EIDH,0)
// RXF1EIDH<RXF1EID9>
extern volatile __bit                   RXF1EID9            __at(0x7831);	// @ (0xF06 * 8 + 1)
#define                                 RXF1EID9_bit        _BIT_ACCESS(RXF1EIDH,1)
// RXFCON0<RXF1EN>
extern volatile __bit                   RXF1EN              __at(0x6EA1);	// @ (0xDD4 * 8 + 1)
#define                                 RXF1EN_bit          _BIT_ACCESS(RXFCON0,1)
// RXF1SIDL<RXF1EXIDEN>
extern volatile __bit                   RXF1EXIDEN          __at(0x782B);	// @ (0xF05 * 8 + 3)
#define                                 RXF1EXIDEN_bit      _BIT_ACCESS(RXF1SIDL,3)
// RXF1SIDL<RXF1SID0>
extern volatile __bit                   RXF1SID0            __at(0x782D);	// @ (0xF05 * 8 + 5)
#define                                 RXF1SID0_bit        _BIT_ACCESS(RXF1SIDL,5)
// RXF1SIDL<RXF1SID1>
extern volatile __bit                   RXF1SID1            __at(0x782E);	// @ (0xF05 * 8 + 6)
#define                                 RXF1SID1_bit        _BIT_ACCESS(RXF1SIDL,6)
// RXF1SIDH<RXF1SID10>
extern volatile __bit                   RXF1SID10           __at(0x7827);	// @ (0xF04 * 8 + 7)
#define                                 RXF1SID10_bit       _BIT_ACCESS(RXF1SIDH,7)
// RXF1SIDL<RXF1SID2>
extern volatile __bit                   RXF1SID2            __at(0x782F);	// @ (0xF05 * 8 + 7)
#define                                 RXF1SID2_bit        _BIT_ACCESS(RXF1SIDL,7)
// RXF1SIDH<RXF1SID3>
extern volatile __bit                   RXF1SID3            __at(0x7820);	// @ (0xF04 * 8 + 0)
#define                                 RXF1SID3_bit        _BIT_ACCESS(RXF1SIDH,0)
// RXF1SIDH<RXF1SID4>
extern volatile __bit                   RXF1SID4            __at(0x7821);	// @ (0xF04 * 8 + 1)
#define                                 RXF1SID4_bit        _BIT_ACCESS(RXF1SIDH,1)
// RXF1SIDH<RXF1SID5>
extern volatile __bit                   RXF1SID5            __at(0x7822);	// @ (0xF04 * 8 + 2)
#define                                 RXF1SID5_bit        _BIT_ACCESS(RXF1SIDH,2)
// RXF1SIDH<RXF1SID6>
extern volatile __bit                   RXF1SID6            __at(0x7823);	// @ (0xF04 * 8 + 3)
#define                                 RXF1SID6_bit        _BIT_ACCESS(RXF1SIDH,3)
// RXF1SIDH<RXF1SID7>
extern volatile __bit                   RXF1SID7            __at(0x7824);	// @ (0xF04 * 8 + 4)
#define                                 RXF1SID7_bit        _BIT_ACCESS(RXF1SIDH,4)
// RXF1SIDH<RXF1SID8>
extern volatile __bit                   RXF1SID8            __at(0x7825);	// @ (0xF04 * 8 + 5)
#define                                 RXF1SID8_bit        _BIT_ACCESS(RXF1SIDH,5)
// RXF1SIDH<RXF1SID9>
extern volatile __bit                   RXF1SID9            __at(0x7826);	// @ (0xF04 * 8 + 6)
#define                                 RXF1SID9_bit        _BIT_ACCESS(RXF1SIDH,6)
// RXF2EIDL<RXF2EID0>
extern volatile __bit                   RXF2EID0            __at(0x7858);	// @ (0xF0B * 8 + 0)
#define                                 RXF2EID0_bit        _BIT_ACCESS(RXF2EIDL,0)
// RXF2EIDL<RXF2EID1>
extern volatile __bit                   RXF2EID1            __at(0x7859);	// @ (0xF0B * 8 + 1)
#define                                 RXF2EID1_bit        _BIT_ACCESS(RXF2EIDL,1)
// RXF2EIDH<RXF2EID10>
extern volatile __bit                   RXF2EID10           __at(0x7852);	// @ (0xF0A * 8 + 2)
#define                                 RXF2EID10_bit       _BIT_ACCESS(RXF2EIDH,2)
// RXF2EIDH<RXF2EID11>
extern volatile __bit                   RXF2EID11           __at(0x7853);	// @ (0xF0A * 8 + 3)
#define                                 RXF2EID11_bit       _BIT_ACCESS(RXF2EIDH,3)
// RXF2EIDH<RXF2EID12>
extern volatile __bit                   RXF2EID12           __at(0x7854);	// @ (0xF0A * 8 + 4)
#define                                 RXF2EID12_bit       _BIT_ACCESS(RXF2EIDH,4)
// RXF2EIDH<RXF2EID13>
extern volatile __bit                   RXF2EID13           __at(0x7855);	// @ (0xF0A * 8 + 5)
#define                                 RXF2EID13_bit       _BIT_ACCESS(RXF2EIDH,5)
// RXF2EIDH<RXF2EID14>
extern volatile __bit                   RXF2EID14           __at(0x7856);	// @ (0xF0A * 8 + 6)
#define                                 RXF2EID14_bit       _BIT_ACCESS(RXF2EIDH,6)
// RXF2EIDH<RXF2EID15>
extern volatile __bit                   RXF2EID15           __at(0x7857);	// @ (0xF0A * 8 + 7)
#define                                 RXF2EID15_bit       _BIT_ACCESS(RXF2EIDH,7)
// RXF2SIDL<RXF2EID16>
extern volatile __bit                   RXF2EID16           __at(0x7848);	// @ (0xF09 * 8 + 0)
#define                                 RXF2EID16_bit       _BIT_ACCESS(RXF2SIDL,0)
// RXF2SIDL<RXF2EID17>
extern volatile __bit                   RXF2EID17           __at(0x7849);	// @ (0xF09 * 8 + 1)
#define                                 RXF2EID17_bit       _BIT_ACCESS(RXF2SIDL,1)
// RXF2EIDL<RXF2EID2>
extern volatile __bit                   RXF2EID2            __at(0x785A);	// @ (0xF0B * 8 + 2)
#define                                 RXF2EID2_bit        _BIT_ACCESS(RXF2EIDL,2)
// RXF2EIDL<RXF2EID3>
extern volatile __bit                   RXF2EID3            __at(0x785B);	// @ (0xF0B * 8 + 3)
#define                                 RXF2EID3_bit        _BIT_ACCESS(RXF2EIDL,3)
// RXF2EIDL<RXF2EID4>
extern volatile __bit                   RXF2EID4            __at(0x785C);	// @ (0xF0B * 8 + 4)
#define                                 RXF2EID4_bit        _BIT_ACCESS(RXF2EIDL,4)
// RXF2EIDL<RXF2EID5>
extern volatile __bit                   RXF2EID5            __at(0x785D);	// @ (0xF0B * 8 + 5)
#define                                 RXF2EID5_bit        _BIT_ACCESS(RXF2EIDL,5)
// RXF2EIDL<RXF2EID6>
extern volatile __bit                   RXF2EID6            __at(0x785E);	// @ (0xF0B * 8 + 6)
#define                                 RXF2EID6_bit        _BIT_ACCESS(RXF2EIDL,6)
// RXF2EIDL<RXF2EID7>
extern volatile __bit                   RXF2EID7            __at(0x785F);	// @ (0xF0B * 8 + 7)
#define                                 RXF2EID7_bit        _BIT_ACCESS(RXF2EIDL,7)
// RXF2EIDH<RXF2EID8>
extern volatile __bit                   RXF2EID8            __at(0x7850);	// @ (0xF0A * 8 + 0)
#define                                 RXF2EID8_bit        _BIT_ACCESS(RXF2EIDH,0)
// RXF2EIDH<RXF2EID9>
extern volatile __bit                   RXF2EID9            __at(0x7851);	// @ (0xF0A * 8 + 1)
#define                                 RXF2EID9_bit        _BIT_ACCESS(RXF2EIDH,1)
// RXFCON0<RXF2EN>
extern volatile __bit                   RXF2EN              __at(0x6EA2);	// @ (0xDD4 * 8 + 2)
#define                                 RXF2EN_bit          _BIT_ACCESS(RXFCON0,2)
// RXF2SIDL<RXF2EXIDEN>
extern volatile __bit                   RXF2EXIDEN          __at(0x784B);	// @ (0xF09 * 8 + 3)
#define                                 RXF2EXIDEN_bit      _BIT_ACCESS(RXF2SIDL,3)
// RXF2SIDL<RXF2SID0>
extern volatile __bit                   RXF2SID0            __at(0x784D);	// @ (0xF09 * 8 + 5)
#define                                 RXF2SID0_bit        _BIT_ACCESS(RXF2SIDL,5)
// RXF2SIDL<RXF2SID1>
extern volatile __bit                   RXF2SID1            __at(0x784E);	// @ (0xF09 * 8 + 6)
#define                                 RXF2SID1_bit        _BIT_ACCESS(RXF2SIDL,6)
// RXF2SIDH<RXF2SID10>
extern volatile __bit                   RXF2SID10           __at(0x7847);	// @ (0xF08 * 8 + 7)
#define                                 RXF2SID10_bit       _BIT_ACCESS(RXF2SIDH,7)
// RXF2SIDL<RXF2SID2>
extern volatile __bit                   RXF2SID2            __at(0x784F);	// @ (0xF09 * 8 + 7)
#define                                 RXF2SID2_bit        _BIT_ACCESS(RXF2SIDL,7)
// RXF2SIDH<RXF2SID3>
extern volatile __bit                   RXF2SID3            __at(0x7840);	// @ (0xF08 * 8 + 0)
#define                                 RXF2SID3_bit        _BIT_ACCESS(RXF2SIDH,0)
// RXF2SIDH<RXF2SID4>
extern volatile __bit                   RXF2SID4            __at(0x7841);	// @ (0xF08 * 8 + 1)
#define                                 RXF2SID4_bit        _BIT_ACCESS(RXF2SIDH,1)
// RXF2SIDH<RXF2SID5>
extern volatile __bit                   RXF2SID5            __at(0x7842);	// @ (0xF08 * 8 + 2)
#define                                 RXF2SID5_bit        _BIT_ACCESS(RXF2SIDH,2)
// RXF2SIDH<RXF2SID6>
extern volatile __bit                   RXF2SID6            __at(0x7843);	// @ (0xF08 * 8 + 3)
#define                                 RXF2SID6_bit        _BIT_ACCESS(RXF2SIDH,3)
// RXF2SIDH<RXF2SID7>
extern volatile __bit                   RXF2SID7            __at(0x7844);	// @ (0xF08 * 8 + 4)
#define                                 RXF2SID7_bit        _BIT_ACCESS(RXF2SIDH,4)
// RXF2SIDH<RXF2SID8>
extern volatile __bit                   RXF2SID8            __at(0x7845);	// @ (0xF08 * 8 + 5)
#define                                 RXF2SID8_bit        _BIT_ACCESS(RXF2SIDH,5)
// RXF2SIDH<RXF2SID9>
extern volatile __bit                   RXF2SID9            __at(0x7846);	// @ (0xF08 * 8 + 6)
#define                                 RXF2SID9_bit        _BIT_ACCESS(RXF2SIDH,6)
// RXF3EIDL<RXF3EID0>
extern volatile __bit                   RXF3EID0            __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 RXF3EID0_bit        _BIT_ACCESS(RXF3EIDL,0)
// RXF3EIDL<RXF3EID1>
extern volatile __bit                   RXF3EID1            __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 RXF3EID1_bit        _BIT_ACCESS(RXF3EIDL,1)
// RXF3EIDH<RXF3EID10>
extern volatile __bit                   RXF3EID10           __at(0x7872);	// @ (0xF0E * 8 + 2)
#define                                 RXF3EID10_bit       _BIT_ACCESS(RXF3EIDH,2)
// RXF3EIDH<RXF3EID11>
extern volatile __bit                   RXF3EID11           __at(0x7873);	// @ (0xF0E * 8 + 3)
#define                                 RXF3EID11_bit       _BIT_ACCESS(RXF3EIDH,3)
// RXF3EIDH<RXF3EID12>
extern volatile __bit                   RXF3EID12           __at(0x7874);	// @ (0xF0E * 8 + 4)
#define                                 RXF3EID12_bit       _BIT_ACCESS(RXF3EIDH,4)
// RXF3EIDH<RXF3EID13>
extern volatile __bit                   RXF3EID13           __at(0x7875);	// @ (0xF0E * 8 + 5)
#define                                 RXF3EID13_bit       _BIT_ACCESS(RXF3EIDH,5)
// RXF3EIDH<RXF3EID14>
extern volatile __bit                   RXF3EID14           __at(0x7876);	// @ (0xF0E * 8 + 6)
#define                                 RXF3EID14_bit       _BIT_ACCESS(RXF3EIDH,6)
// RXF3EIDH<RXF3EID15>
extern volatile __bit                   RXF3EID15           __at(0x7877);	// @ (0xF0E * 8 + 7)
#define                                 RXF3EID15_bit       _BIT_ACCESS(RXF3EIDH,7)
// RXF3SIDL<RXF3EID16>
extern volatile __bit                   RXF3EID16           __at(0x7868);	// @ (0xF0D * 8 + 0)
#define                                 RXF3EID16_bit       _BIT_ACCESS(RXF3SIDL,0)
// RXF3SIDL<RXF3EID17>
extern volatile __bit                   RXF3EID17           __at(0x7869);	// @ (0xF0D * 8 + 1)
#define                                 RXF3EID17_bit       _BIT_ACCESS(RXF3SIDL,1)
// RXF3EIDL<RXF3EID2>
extern volatile __bit                   RXF3EID2            __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 RXF3EID2_bit        _BIT_ACCESS(RXF3EIDL,2)
// RXF3EIDL<RXF3EID3>
extern volatile __bit                   RXF3EID3            __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 RXF3EID3_bit        _BIT_ACCESS(RXF3EIDL,3)
// RXF3EIDL<RXF3EID4>
extern volatile __bit                   RXF3EID4            __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 RXF3EID4_bit        _BIT_ACCESS(RXF3EIDL,4)
// RXF3EIDL<RXF3EID5>
extern volatile __bit                   RXF3EID5            __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 RXF3EID5_bit        _BIT_ACCESS(RXF3EIDL,5)
// RXF3EIDL<RXF3EID6>
extern volatile __bit                   RXF3EID6            __at(0x787E);	// @ (0xF0F * 8 + 6)
#define                                 RXF3EID6_bit        _BIT_ACCESS(RXF3EIDL,6)
// RXF3EIDL<RXF3EID7>
extern volatile __bit                   RXF3EID7            __at(0x787F);	// @ (0xF0F * 8 + 7)
#define                                 RXF3EID7_bit        _BIT_ACCESS(RXF3EIDL,7)
// RXF3EIDH<RXF3EID8>
extern volatile __bit                   RXF3EID8            __at(0x7870);	// @ (0xF0E * 8 + 0)
#define                                 RXF3EID8_bit        _BIT_ACCESS(RXF3EIDH,0)
// RXF3EIDH<RXF3EID9>
extern volatile __bit                   RXF3EID9            __at(0x7871);	// @ (0xF0E * 8 + 1)
#define                                 RXF3EID9_bit        _BIT_ACCESS(RXF3EIDH,1)
// RXFCON0<RXF3EN>
extern volatile __bit                   RXF3EN              __at(0x6EA3);	// @ (0xDD4 * 8 + 3)
#define                                 RXF3EN_bit          _BIT_ACCESS(RXFCON0,3)
// RXF3SIDL<RXF3EXIDEN>
