MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2682/mcu.h
extern volatile __bit                   TXB2EXIDE           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 TXB2EXIDE_bit       _BIT_ACCESS(TXB2SIDL,3)
// PIR3<TXB2IF>
extern volatile __bit                   TXB2IF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXB2IF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXB2IP>
extern volatile __bit                   TXB2IP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXB2IP_bit          _BIT_ACCESS(IPR3,4)
// TXB2CON<TXB2LARB>
extern volatile __bit                   TXB2LARB            __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 TXB2LARB_bit        _BIT_ACCESS(TXB2CON,5)
// TXB2CON<TXB2PRI0>
extern volatile __bit                   TXB2PRI0            __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 TXB2PRI0_bit        _BIT_ACCESS(TXB2CON,0)
// TXB2CON<TXB2PRI1>
extern volatile __bit                   TXB2PRI1            __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 TXB2PRI1_bit        _BIT_ACCESS(TXB2CON,1)
// TXB2CON<TXB2REQ>
extern volatile __bit                   TXB2REQ             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 TXB2REQ_bit         _BIT_ACCESS(TXB2CON,3)
// TXB2DLC<TXB2RTR>
extern volatile __bit                   TXB2RTR             __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 TXB2RTR_bit         _BIT_ACCESS(TXB2DLC,6)
// TXB2SIDL<TXB2SID0>
extern volatile __bit                   TXB2SID0            __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 TXB2SID0_bit        _BIT_ACCESS(TXB2SIDL,5)
// TXB2SIDL<TXB2SID1>
extern volatile __bit                   TXB2SID1            __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 TXB2SID1_bit        _BIT_ACCESS(TXB2SIDL,6)
// TXB2SIDH<TXB2SID10>
extern volatile __bit                   TXB2SID10           __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 TXB2SID10_bit       _BIT_ACCESS(TXB2SIDH,7)
// TXB2SIDL<TXB2SID2>
extern volatile __bit                   TXB2SID2            __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 TXB2SID2_bit        _BIT_ACCESS(TXB2SIDL,7)
// TXB2SIDH<TXB2SID3>
extern volatile __bit                   TXB2SID3            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 TXB2SID3_bit        _BIT_ACCESS(TXB2SIDH,0)
// TXB2SIDH<TXB2SID4>
extern volatile __bit                   TXB2SID4            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 TXB2SID4_bit        _BIT_ACCESS(TXB2SIDH,1)
// TXB2SIDH<TXB2SID5>
extern volatile __bit                   TXB2SID5            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 TXB2SID5_bit        _BIT_ACCESS(TXB2SIDH,2)
// TXB2SIDH<TXB2SID6>
extern volatile __bit                   TXB2SID6            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 TXB2SID6_bit        _BIT_ACCESS(TXB2SIDH,3)
// TXB2SIDH<TXB2SID7>
extern volatile __bit                   TXB2SID7            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 TXB2SID7_bit        _BIT_ACCESS(TXB2SIDH,4)
// TXB2SIDH<TXB2SID8>
extern volatile __bit                   TXB2SID8            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXB2SID8_bit        _BIT_ACCESS(TXB2SIDH,5)
// TXB2SIDH<TXB2SID9>
extern volatile __bit                   TXB2SID9            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 TXB2SID9_bit        _BIT_ACCESS(TXB2SIDH,6)
// TXB2CON<TXBIFBXB2CON>
extern volatile __bit                   TXBIFBXB2CON        __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 TXBIFBXB2CON_bit    _BIT_ACCESS(TXB2CON,7)
// TXB1CON<TXBIFTXB1CON>
extern volatile __bit                   TXBIFTXB1CON        __at(0x7987);	// @ (0xF30 * 8 + 7)
#define                                 TXBIFTXB1CON_bit    _BIT_ACCESS(TXB1CON,7)
// IPR1<TXBIP>
extern volatile __bit                   TXBIP               __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXBIP_bit           _BIT_ACCESS(IPR1,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// COMSTAT<TXBO>
extern volatile __bit                   TXBO                __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 TXBO_bit            _BIT_ACCESS(COMSTAT,5)
// COMSTAT<TXBP>
extern volatile __bit                   TXBP                __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 TXBP_bit            _BIT_ACCESS(COMSTAT,4)
// PIE3<TXBnIE>
extern volatile __bit                   TXBnIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBnIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBnIF>
extern volatile __bit                   TXBnIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBnIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBnIP>
extern volatile __bit                   TXBnIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBnIP_bit          _BIT_ACCESS(IPR3,4)
// BAUDCON<TXCKP>
extern volatile __bit                   TXCKP               __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 TXCKP_bit           _BIT_ACCESS(BAUDCON,4)
// TXSTA<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA,0)
// TXSTA<TXEN>
extern volatile __bit                   TXEN                __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN_bit            _BIT_ACCESS(TXSTA,5)
// TXSTA<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// COMSTAT<TXWARN>
extern volatile __bit                   TXWARN              __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 TXWARN_bit          _BIT_ACCESS(COMSTAT,2)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// ADCON1<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG11_bit          _BIT_ACCESS(ADCON1,5)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// PORTA<VREFM>
extern volatile __bit                   VREFM               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 VREFM_bit           _BIT_ACCESS(PORTA,2)
// PORTA<VREFP>
extern volatile __bit                   VREFP               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 VREFP_bit           _BIT_ACCESS(PORTA,3)
// BAUDCON<W4E>
extern volatile __bit                   W4E                 __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUDCON,1)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(_PR2,4)  // Note: Changed by MikroE
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(_PR2,5)  // Note: Changed by MikroE
// BRGCON3<WAKDIS>
extern volatile __bit                   WAKDIS              __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 WAKDIS_bit          _BIT_ACCESS(BRGCON3,7)
// BRGCON3<WAKFIL>
extern volatile __bit                   WAKFIL              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 WAKFIL_bit          _BIT_ACCESS(BRGCON3,6)
// PIE3<WAKIE>
extern volatile __bit                   WAKIE               __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 WAKIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<WAKIF>
extern volatile __bit                   WAKIF               __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 WAKIF_bit           _BIT_ACCESS(PIR3,6)
// IPR3<WAKIP>
extern volatile __bit                   WAKIP               __at(0x7D2E);	// @ (0xFA5 * 8 + 6)
#define                                 WAKIP_bit           _BIT_ACCESS(IPR3,6)
// SSPCON1<WCOL>
extern volatile __bit                   WCOL                __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSPCON1,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(_PR2,0)  // Note: Changed by MikroE
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(_PR2,1)  // Note: Changed by MikroE
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7D33);	// @ (0xFA6 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// BAUDCON<WUE>
extern volatile __bit                   WUE                 __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 WUE_bit             _BIT_ACCESS(BAUDCON,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSPSTAT<nA>
extern volatile __bit                   nA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSPSTAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// COMSTAT<nFIFOEMPTY>
extern volatile __bit                   nFIFOEMPTY          __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 nFIFOEMPTY_bit      _BIT_ACCESS(COMSTAT,7)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// PORTA<nSS>
extern volatile __bit                   nSS                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 nSS_bit             _BIT_ACCESS(PORTA,5)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// SSPSTAT<nW>
extern volatile __bit                   nW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nW_bit              _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<nWRITE>
extern volatile __bit                   nWRITE              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nWRITE_bit          _BIT_ACCESS(SSPSTAT,2)

#endif // _PIC18LF2682_H_
